package Day11.Demo02;
/*
Java中有四种权限修饰符：
             public > protected > (default) > private
同一个类        Yes         Yes        Yes         Yes
同一个包        Yes         Yes        Yes         No
不同包子类      Yes          Yes        No         No
不同包非子类    Yes          No        No         No

如果一个事物的内部包含另一个事物，那么这就是一个类内部包含另一个类
例如： 身体和心脏的关系

分类：
1. 成员内部类
2. 局部内部类（包含匿名内部类）

成员内部类的定义格式：
修饰符 class 类名称{
    修饰符 class 类名称{
        // ...
    }
    // ...
}
注意： 内部类使用外部类，可以随意访问；外部类使用内部类一定要使用内部类对象
=================================
如何使用成员内部类？ 有两种方式
1. 间接方式：在外部类的方法中，使用内部类；然后main只是调用外部类的方法
2. 直接方式，公式：
2. 直接方式，公式：
类名称 对象名 = new 类名称（）；
【外部类名称.内部类名称 对象名 = new 外部类名称（）.new 内部类名称（）；】
 */
public class Demo01Main {
}
