package Day11.Demo01;
/*
当final关键字用来修饰一个类的时候，格式：
public final class 类名称{
    // ...
}
含义： 当前这个类不能有任何的子类。(太监类)
注意：一个类如果是final的，那么其中所有的成员方法都没法进行覆盖重写（因为没有子类 ）
==========================================================================
当final关键字用来修饰一个方法的时候，这个方法就是最终该方法，也就是不能被覆盖重写
格式：
修饰符 final 返回值类型 方法名称（参数列表）{
    //方法体
}
注意事项：
对于类，方法来说，abstract关键字和final关键字不能同时使用，因为矛盾
==========================================================================
一旦使用final用来修饰局部变量，那么这个变量就不能进行更改
一次赋值，终生不变（保证有唯一一次赋值即可）
======
对于基本类型来说，不可变说的是变量当中的数据不可改变
对于引用类型来说，不可变说的是变量当中的地址值不可改变
 */
public final class MyClass {
}
